nexts-corp/int-sma/PWA_SL/Project/FreeRTOS/SmartLogger_Mini_SMA/INTELENICS_Library/src/INT_STM32F4_ProtocolComm.c
/**
  ******************************************************************************
  * <h2><center>&copy; Intelenics Co., Ltd.</center></h2>
  * @file    	INT_STM32F4_ProtocolComm.c
  * @author  	BIG M
  * @version 	V1.0.0
  * @date    	21-March-2014
  * @brief   
  ******************************************************************************
  * @attention
  *
  ******************************************************************************
  */
	

#include "stm32f4xx.h"
#include "stdio.h"
#include "stdlib.h"
#include "string.h"
#include "FreeRTOS.h"

#include "main.h"
#include "stm32f4_SDCard.h"
#include "SD_Task.h"
#include "SL_PinDefine.h"
#include "INT_STM32F4_ProtocolComm.h"
#include "INT_STM32F4_ProtocolParser.h"
#include "INT_STM32F4_ProtocolHandle.h"
#include "INT_STM32F4_PacketQueue.h"
#include "INT_STM32F4_debug.h"
#include "INT_STM32F4_Usart.h"
#include "INT_STM32F4_ConfigSD.h"
#include "INT_STM32F4_log.h"
#include "INT_STM32F4_Timer.h"
#include "INT_STM32F4_aes128.h"
#include "INT_STM32F4_rtc.h"

#include "INT_STM32F4_GSM.h"

uint8_t IN420MA_CH[] = {IN420MA_CH1,IN420MA_CH2,IN420MA_CH3,IN420MA_CH4,IN420MA_CH5,IN420MA_CH6};

const uint8_t CONF_CNFG_420SENSORn[] = {CONF_CNFG_420SENSOR1, CONF_CNFG_420SENSOR2, CONF_CNFG_420SENSOR3, CONF_CNFG_420SENSOR4,
																				CONF_CNFG_420SENSOR5, CONF_CNFG_420SENSOR6};

const uint8_t CONF_CNFG_ADCSENSORn[] = {CONF_CNFG_ADCSENSOR1, CONF_CNFG_ADCSENSOR2};

const uint8_t CONF_CNFG_CAL420SENn[] = {CONF_CNFG_CAL420SEN1, CONF_CNFG_CAL420SEN2, CONF_CNFG_CAL420SEN3, CONF_CNFG_CAL420SEN4,
																				CONF_CNFG_CAL420SEN5, CONF_CNFG_CAL420SEN6};

const uint8_t CONF_CNFG_420SENsALn[] = {CONF_CNFG_420SENsAL1,CONF_CNFG_420SENsAL2,CONF_CNFG_420SENsAL3,CONF_CNFG_420SENsAL4,
																				CONF_CNFG_420SENsAL5,CONF_CNFG_420SENsAL6};

const uint8_t CONF_CNFG_ADCSENsALn[] = {CONF_CNFG_420SENsAL1,CONF_CNFG_420SENsAL2};

const uint8_t CONF_CNFG_DINn[] = {CONF_CNFG_DIN1,CONF_CNFG_DIN2,CONF_CNFG_DIN3,CONF_CNFG_DIN4,CONF_CNFG_DIN5,CONF_CNFG_DIN6,
																	CONF_CNFG_DIN7,CONF_CNFG_DIN8,CONF_CNFG_DIN9,CONF_CNFG_DIN10,CONF_CNFG_DIN11,CONF_CNFG_DIN12};

extern xQueueHandle 	Queue_PacketHTTPToGSM;
extern xQueueHandle 	Queue_PacketToGSM;
extern 	xQueueHandle 	Queue_PacketFromGSM;
extern __IO uint32_t 	_heartbeatCounter;
extern __IO uint8_t		_SendRegisCounter;
extern __IO uint8_t		_SendJoinCounter;
extern uint32_t				_JoinPendingTimeout;
extern uint32_t				_RegisPendingTimeout;
extern __IO uint32_t		_GSMCounter;
extern __IO uint8_t			_ConfigCmdFID;

uint8_t 	_PENDING_ID[8] = {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00};
uint16_t		_DataLog_WaitID = 0x00;
uint16_t		_EventLog_WaitID = 0x00;
uint16_t		_ConfigLog_WaitID = 0x00;

/*==========================================================================================*/
/**
  * @brief  Receive Data Packet
  * @param  None
  * @retval Return protocol function code
  */
PTC_RES ucPROCOMM_ReceivePacket(void) {

	uint8_t 		recvPacket[RX_BUFFER_SIZE1];           
	uint16_t 		size 		= 0;           
	uint16_t 		offset 	= 0;
	uint16_t 		length 	= 0;
	uint16_t 		total 	= 0;
	uint8_t 		i;
				
	size = usUSART_ReadUart1(&recvPacket[0], (RX_BUFFER_SIZE1-1), 5);
	if(size <= 0) {
		/* Not have receive data packet */
		return PTC_PKT_EMPTY;
	}
	else{						/* command GSM module config */
// 		recvPacket[size] 		= '\r';
// 		recvPacket[size+1]	= '\n';
// 		vGSM_SendATcommand( ( char* )recvPacket, size+1 );
// 		recvPacket[size+2]	= '\0';
// 		printf("%s",recvPacket);

// 		memcpy( ( char* )recvPacket, "", 100 );
	}
	
	if(xSemaphoreTake(xSemaphore, SEMPHR_WAIT)) {
		printDebug(INFO, "Receive Packet(%d): \r\n", size);
//		print_payload(INFO, recvPacket, size);
		for(i=0;i<size;i++) {
			printDebug(INFO, "%02X ", recvPacket[i]);
		}
		printDebug(INFO, "\r\n");
		xSemaphoreGive(xSemaphore);
	}
	
	
	
	do {
		offset += strcspn((const char*)&recvPacket[offset], "\x7E");                      				/* seach for header */
		if(offset == size) {                 
			/* Not found Start Delimiter 0x7E */
			break;
		}
		length = (recvPacket[offset+1] & 0xFFFF) << 8;                                       			/* check packet length (MSB) */
		length |= recvPacket[offset+2];                                                      			/* check packet length (LSB) */
		total += length;                                                                     			/* update total analyse */ 
		if (total > size) {                                                                				/* check length validation */
			offset++;
			total = offset;                                                               					/* roll back total analyse */                        
			/* invalid length */
			printDebug_Semphr(INFO, "<PROCOMM_ReceivePacket>: Invalid length %d \r\n", total);
			continue;
		}                             
			
		if(ucPROCOMM_Checksum(&recvPacket[offset+3], length) != recvPacket[offset+length+3]) {   	/* checksum error detection */                  
			/* Incorrect checksum */
			offset++;
			total = offset;                                                               					/* roll back total analyse */  
			printDebug_Semphr(INFO, "<PROCOMM_ReceivePacket>: Incorrect checksum %d\r\n", total);
		}else {                                                                             			/* got a valid packet */     
			xPROCOMM_ProcessPacket(&recvPacket[offset+3], length, DEBUG_PORT);                      /* analyse API-specific Structure */ 
			offset += (length+4);
			total 	= offset; 
		}
	}while(total < size);
	
	return PTC_OK;
}
/*==========================================================================================*/
/**
  * @brief  Process INT_COMM_PROTOCOL Data Packet
  * @param  
  * @retval Return protocol function code
  */
PTC_RES xPROCOMM_ProcessPacket(uint8_t *buf, uint16_t length, uint8_t source) {

	uint16_t 	frameID;																																/* Frame id */
	uint8_t 	frameType;																															/* Frame type */
	uint16_t 	MTI;																																		/* Message type indicator */
	uint8_t		MTI_class;																															/* MTI-SMA Message class */
	uint8_t		MTI_function;																														/* MTI-SMA Message function */
	uint8_t		MTI_hostrequset;																												/* MTI-SMA Message Host Request */ 
	uint16_t 	DataelementsLen;     																										/* Data elements length */
	uint16_t  i;
	uint8_t		configSpec[162]; 					// Reserve for Max Specific_Struct Length (Properties_Config:161 bytes)
	uint16_t	configSpecLen = 0;
	uint8_t 	challenge[16];
	uint8_t		save_regis	= 0;
	uint8_t		res = 0;
	
	PTC_RES					ptc_res;
	ST_LOG_DATA   	log_data;
	ST_LOG_EVENT   	log_event;
	ST_LOG_CONFIG  	log_config;
	
