nexts-corp/int-sma/PWA_SL/Project/FreeRTOS/SmartLogger_Mini_SMA/INTELENICS_Library/src/INT_STM32F4_ProtocolComm.c
//	if(xSemaphoreTake(xSemaphore, SEMPHR_WAIT)) {
//		printDebug(INFO, "Receive Packet(%d): \r\n", length);
//		print_payload(INFO, buf, length);
//		xSemaphoreGive(xSemaphore);
//	}
	
	MTI							= (buf[INDEX2_MTI] << 8) + buf[INDEX2_MTI+1];
	frameID     		= (buf[INDEX2_FRAMEID] << 8) + buf[INDEX2_FRAMEID+1]; 
	frameType   		= buf[INDEX2_FRAMETYPE];
	
	MTI_class				=	MTI >> 8;
	MTI_function 		= (MTI & 0xFF) >> 4;
	MTI_hostrequset	=	(MTI & 0x0F);
	
	/* 														MTI		FrameID		TerminalID  TransactionTime */
	DataelementsLen 		= (length  -2     -2 			-ADDR_LEN			-4);

	// Check Receiver Address
// 	if(source == GSM_PORT) {
// 		if(memcmp(&buf[INDEX2_RECVADDR], &struct_info.serialNumber[0], ADDR_LEN) != 0) {
// 			if(xSemaphoreTake(xSemaphore, SEMPHR_WAIT)) {
// 				printDebug(MINOR_ERR, "<PROCOMM_ReceivePacket> Invalid Receiver Address : ");
// 				for(i = INDEX2_RECVADDR; i < (INDEX2_RECVADDR+ADDR_LEN); i++) {
// 					printDebug(MINOR_ERR, "%02X ", buf[i]);
// 				}
// 				printDebug(MINOR_ERR, "\r\n");
// 				xSemaphoreGive(xSemaphore);
// 			}
// 			return PTC_INVAL_ADDR;
// 		}
// 	}
		
	/* Time Sync */
	if(vPTCHANDLE_TimeSync(&buf[INDEX2_TIME])) {
		/* fpPROCOMM_HandleTimeSync Failed */
		printDebug_Semphr(MINOR_ERR, "fpPROCOMM_HandleTimeSync Failed. \r\n");
	}
	
	if(MTI_hostrequset == 1) {
		xPROCOMM_SendConfigManageREQ(source);
	}
	
	switch(frameType) {
	/*------------------------------- Command Packet -------------------------------*/
	case CONFMANC :                                                       						/* [0x4A] Configuration Management CMD */
		printDebug_Semphr(INFO, "-->>> CONFIGURATION_MANAGEMENT CMD : FID[%04X][%02X]\r\n", frameID, buf[INDEX2_CONFIG_CNFG]);
// 		if(buf[INDEX2_CONFIG_ACCD] == CONF_ACCD_READ) {							/* ACCD: READ */
// 			if(vPTCHANDLE_ConfigRead(buf[INDEX2_CONFIG_CNFG], configSpec, &configSpecLen)) {
// 				/* Handle Failed */
// 				printDebug_Semphr(MINOR_ERR, "vPTCHANDLE_ConfigRead Failed. \r\n");
// 				ptc_res = xPROCOMM_SendConfigManageACK(buf[INDEX2_FRAMEID],CONF_ACCD_READ,buf[INDEX2_CONFIG_CNFG],STAT_ERR,NULL,0,source);
// 				if(ptc_res != PTC_OK) {
// 					printDebug_Semphr(MINOR_ERR, "X<<-- CONFIGURATION_MANAGEMENT ACK Failed Err(PTC_%d) \r\n", ptc_res);
// 				}
// 			}else {
// 				/* Handle Success */
// 				ptc_res = xPROCOMM_SendConfigManageACK(buf[INDEX2_FRAMEID],CONF_ACCD_READ,buf[INDEX2_CONFIG_CNFG],STAT_SUCCESS,configSpec,configSpecLen,source);
// 				if(ptc_res != PTC_OK) {
// 					printDebug_Semphr(MINOR_ERR, "X<<-- CONFIGURATION_MANAGEMENT ACK Failed Err(PTC_%d) \r\n", ptc_res);
// 				}
// 			}
// 		}else if(buf[INDEX2_CONFIG_ACCD] == CONF_ACCD_WRITE) {			/* ACCD: WRITE */
			_ConfigCmdFID = frameID;
			res = ucPTCHANDLE_ConfigWrite(&buf[INDEX2_CONFIG_CNFG], source);
			if(res == 0) {
				/* Handle Success */
				ptc_res = xPROCOMM_SendConfigManageACK(frameID, CONF_ACCD_WRITE, buf[INDEX2_CONFIG_CNFG], STAT_SUCCESS,NULL, 0, source);
				if(ptc_res != PTC_OK) {
					printDebug_Semphr(MINOR_ERR, "X<<-- CONFIGURATION_MANAGEMENT ACK Failed Err(PTC_%d) \r\n", ptc_res);
				}
			}else if(res == CONF_CNFG_CMD) {
				/* Special Case */ 
			}else {
				/* Handle Failed */
				printDebug_Semphr(MINOR_ERR, "vPTCHANDLE_ConfigWrite Failed. \r\n");
				ptc_res = xPROCOMM_SendConfigManageACK(frameID, CONF_ACCD_WRITE, buf[INDEX2_CONFIG_CNFG], STAT_ERR, NULL, 0, source);
				if(ptc_res != PTC_OK) {
					printDebug_Semphr(MINOR_ERR, "X<<-- CONFIGURATION_MANAGEMENT ACK Failed Err(PTC_%d) \r\n", ptc_res);
				}
			}
// 		}else if(buf[INDEX2_CONFIG_ACCD] == CONF_ACCD_CONFIRM) {		/* ACCD: CONFIRM */
// 			return PTC_TYP_NREF;
// 		}else if(buf[INDEX2_CONFIG_ACCD] == CONF_ACCD_UPDATE) {			/* ACCD: UPDATE */
// 			return PTC_TYP_NREF;
// 		}else {
// 			return PTC_TYP_NREF;
// 		}
		break;
	case LOGMANIC :																																		/* [0x6A] Log Manipulation CMD */
		printDebug_Semphr(INFO, "-->>> LOG_MANIPULATION CMD : FID[%02X]\r\n", buf[INDEX2_FRAMEID]);
		if(buf[INDEX2_LOG_ACCD] == LOG_ACCD_READDATA) {							/* ACCD: READ DATA LOG */
			vPTCHANDLE_LogManipulate(&buf[INDEX2_LOG_DLOG], frameID);
		}
		break;
	case NETMAINC :                                                       						/* [0x7A] Network Maintenance CMD */
		printDebug_Semphr(INFO, "-->>> NETWORK_MAINTENANCE CMD : CMD[%02X]\r\n", buf[INDEX2_NETMT_CMD]);
		if(buf[INDEX2_NETMT_CMD] == TIMESYNC) {
			if(vPTCHANDLE_TimeSync(&buf[INDEX2_NETMT_TSYNC])) {
				/* fpPROCOMM_HandleTimeSync Failed */
				printDebug_Semphr(MINOR_ERR, "fpPROCOMM_HandleTimeSync Failed. \r\n");
				return PTC_HANDLE_FAILED;
			}
			ptc_res = xPROCOMM_SendNetworkMaintACK(buf[INDEX2_FRAMEID],buf[INDEX2_NETMT_CMD],STAT_SUCCESS,NULL,0);
			if(ptc_res != PTC_OK) {
				printDebug_Semphr(MINOR_ERR, "X<<-- NETWORK_MAINTENANCE ACK Failed Err(PTC_%d) \r\n", ptc_res);
			}
		}else if(buf[INDEX2_NETMT_CMD] == PENDING_APPRV) {
			i = 0;
			if(memcmp(&buf[INDEX2_NETMT_APPPENDING], _PENDING_ID, 8) == 0) {
				if(memcmp(&buf[INDEX2_NETMT_APPSERIAL], &struct_info.serialNumber[0], 8) == 0) {
					_Communication_Status &= ~COMMU_REG_PENDING;		// Update Comm Status
					_Communication_Status |= COMMU_REGISTERED;   		// Update Comm Status
					save_regis = CHECK_REGISTERED;
//					if(!xQueueSend(Queue_SaveRegis, &save_regis, 0)) {
//						printDebug_Semphr(MINOR_ERR, "<PROCOMM_ProcessPacket>: Send Queue_SaveRegis failed. \r\n");
//					}
					printDebug_Semphr(DESCRIBE, "<PROCOMM_ProcessPacket>: Registration Success. \r\n");
					i = 1;
				}
			}
			if(i) {
				ptc_res = xPROCOMM_SendNetworkMaintACK(buf[INDEX2_FRAMEID],buf[INDEX2_NETMT_CMD],STAT_SUCCESS,NULL,0);
				if(ptc_res != PTC_OK) {
					printDebug_Semphr(MINOR_ERR, "X<<-- NETWORK_MAINTENANCE ACK Failed Err(PTC_%d) \r\n", ptc_res);
				}
			}else {
				_Communication_Status &= ~COMMU_REG_PENDING;		// Update Comm Status
				printDebug_Semphr(MINOR_ERR, "<PROCOMM_ProcessPacket>: Registration Failed. \r\n");
				ptc_res = xPROCOMM_SendNetworkMaintACK(buf[INDEX2_FRAMEID],buf[INDEX2_NETMT_CMD],STAT_ERR,NULL,0);
				if(ptc_res != PTC_OK) {
					printDebug_Semphr(MINOR_ERR, "X<<-- NETWORK_MAINTENANCE ACK Failed Err(PTC_%d) \r\n", ptc_res);
				}
			}
		}else if(buf[INDEX2_NETMT_CMD] == CHAP_CMD) {
			ucTIMER_SetTimer(&_JoinPendingTimeout, 120);			// Set join panding timeout
			_Communication_Status |= COMMU_JOIN_PENDING;   		// Update Comm Status
			memcpy(challenge, &buf[INDEX2_NETMT_CHALLENGE], sizeof(challenge));
			if(xSemaphoreTake(xSemaphore, SEMPHR_WAIT)) {
				printDebug(DETAIL, "<PROCOMM_ProcessPacket> CHALLENGE: ");
				for(i = 0; i < sizeof(challenge); i++) {
					printDebug(DETAIL, "%02X ", challenge[i]);
				}
				printDebug(DETAIL, "\r\n");
				xSemaphoreGive(xSemaphore);
			}
			
