nexts-corp/int-sma/PWA_SL/Project/FreeRTOS/SmartLogger_Mini_SMA/INTELENICS_Library/src/INT_STM32F4_ProtocolComm.c
			/* AES-128 Encryption with Private Key */
			vAES_encrypt(challenge, (unsigned char *)_Private_Key);
			
			if(xSemaphoreTake(xSemaphore, SEMPHR_WAIT)) {
				printDebug(DETAIL, "<PROCOMM_ProcessPacket> RESPONSE: ");
				for(i = 0; i < sizeof(challenge); i++) {
					printDebug(DETAIL, "%02X ", challenge[i]);
				}
				printDebug(DETAIL, "\r\n");
				xSemaphoreGive(xSemaphore);
			}
			/* Send CHAP Response to Server */
			ptc_res = xPROCOMM_SendNetworkMaintACK(buf[INDEX2_FRAMEID],buf[INDEX2_NETMT_CMD],STAT_SUCCESS,challenge,sizeof(challenge));
			if(ptc_res != PTC_OK) {
				printDebug_Semphr(MINOR_ERR, "X<<-- NETWORK_MAINTENANCE ACK Failed Err(PTC_%d) \r\n", ptc_res);
			}
		}else {
			return PTC_TYP_NREF;
		}
		break;	
	case RMDCTRLC :                                                       						/* [0x8A] Remote Device Control CMD  */
		printDebug_Semphr(INFO, "-->>> REMOTE_DEVICE_CONTROL CMD : FID[%02X]\r\n", buf[INDEX2_FRAMEID]);
		if(ucPTCHANDLE_RemoteCtrl(buf[INDEX2_REMOTE_CID], &buf[INDEX2_REMOTE_VAL])) {
			/* Handle Failed */
			printDebug_Semphr(MINOR_ERR, "fpPROCOMM_HandleRemoteCtrl Failed. \r\n");
			ptc_res = xPROCOMM_SendRemoteCtrlACK(buf[INDEX2_FRAMEID],buf[INDEX2_REMOTE_CID],STAT_ERR,source);
			if(ptc_res != PTC_OK) {
				printDebug_Semphr(MINOR_ERR, "X<<-- REMOTE_DEVICE_CONTROL ACK Failed Err(PTC_%d) \r\n", ptc_res);
			}
		}else {
			/* Handle Success */
			ptc_res = xPROCOMM_SendRemoteCtrlACK(buf[INDEX2_FRAMEID],buf[INDEX2_REMOTE_CID],STAT_SUCCESS,source);
			if(ptc_res != PTC_OK) {
				printDebug_Semphr(MINOR_ERR, "X<<-- REMOTE_DEVICE_CONTROL ACK Failed Err(PTC_%d) \r\n", ptc_res);
			}
		}
		break;
			
	/*------------------------------- Acknowledgment Packet -------------------------------*/
	case HOSTRESA :																																/* [0x00] Host Reponse Ack */
		switch(buf[INDEX_RESPONSE_CMD]) {
			case EVENREPA :                                                        						/* [0x3B] Event Report ACK */
				printDebug_Semphr(INFO, "-->>> EVENT_REPORT ACK : FID[%04X]\r\n", frameID);
				/* If EventLog ACK, Remove log wait id */
				if((_EventLog_WaitID != 0x00) && (_EventLog_WaitID == frameID)) {
					_EventLog_WaitID = 0x00;
					log_event.cmd = LOG_CMD_SETiNDEX;
					if(!xQueueSend(Queue_EventLogToSD, &log_event, 0)) {
						printDebug_Semphr(MINOR_ERR, "<PROCOMM_ProcessPacket>: Send Queue_EventLogToSD failed. \r\n");
					}
				}
				if(ucPKTQUEUE_Remove(packet_Queue, &_Queue_counter, frameID)) {
					/* Remove packet from queue failed */
					return PTC_HANDLE_FAILED;
				}
				break;
			case CONFMANA :                                                        						/* [0x4B] Configuration Management ACK */ 
				printDebug_Semphr(INFO, "-->>> CONFIGURATION_MANAGEMENT ACK : FID[%04X]\r\n", frameID);
				/* If ConfigLog ACK, Remove log wait id */
				if((_ConfigLog_WaitID != 0x00) && (_ConfigLog_WaitID == frameID)) {
					_ConfigLog_WaitID = 0x00;
					log_config.cmd = LOG_CMD_SETiNDEX;
					if(!xQueueSend(Queue_ConfigLogToSD, &log_config, 0)) {
						printDebug_Semphr(MINOR_ERR, "<PROCOMM_ProcessPacket>: Send Queue_ConfigLogToSD failed. \r\n");
					}
				}
				if(ucPKTQUEUE_Remove(packet_Queue, &_Queue_counter, frameID)) {
					/* Remove packet from queue failed */
					return PTC_HANDLE_FAILED;
				}
				break;
			
			case STATREPC :                                                        						/* [0x9B] Data&Status Report ACK */  
				printDebug_Semphr(INFO, "-->>> DATA&STATUS_REPORT ACK : FID[%04X]\r\n", frameID);
			
				/* If DataLog ACK, Remove log wait id */
				if((_DataLog_WaitID != 0x00) && (_DataLog_WaitID == frameID)) {
					_DataLog_WaitID = 0x00;
					log_data.cmd = LOG_CMD_SETiNDEX;
					if(!xQueueSend(Queue_DataLogToSD, &log_data, 0)) {
						printDebug_Semphr(MINOR_ERR, "<PROCOMM_ProcessPacket>: Send Queue_DataLogToSD failed. \r\n");
					}
				}
				
				if(ucPKTQUEUE_Remove(packet_Queue, &_Queue_counter, frameID)) {
					/* Remove packet from queue failed */
					return PTC_HANDLE_FAILED;
				}
				break;
			default:  
				printDebug_Semphr(INFO, "\r\n-->>> RECEIVE INT_COMM> Tag response not define or not reference yet (0x%02X)!!\r\n\r\n", buf[INDEX_RESPONSE_CMD]);
//			INT_sendProtocolErrorFeedbackAck(frameID, INVALID_FTYPE);                
			return PTC_TYP_NDEF;
		}
		
		/* Reset GSM Timer Counter */
		_GSMCounter				= 0;
		LED_CONNSERVER_GREEN;				// Update CONNSERVER LED Indicator
		break;
		
	case PROTOERROR :                                                      						/* [0xEB] Protocol Error Feedback */    
		printDebug_Semphr(INFO, "\r\n-->>> PROTOCOL_ERROR_FEEDBACK_ACK : FRAME ID[%04X] ERROR ID[0x%02X]\r\n\r\n", frameID, buf[31] );                                 
		break;
	
	default:                      
		printDebug_Semphr(INFO, "\r\n-->>> RECEIVE INT_COMM> Frame Type not define or not reference yet (0x%02X)!!\r\n\r\n", frameType);
//		INT_sendProtocolErrorFeedbackAck(frameID, INVALID_FTYPE);                
		return PTC_TYP_NDEF;
	}
	
	return PTC_OK;     
}
/*==========================================================================================*/
/**
  * @brief  Send Configuration_Management Cmd
  * @param  
  * @retval Return protocol function code
  */
PTC_RES xPROCOMM_SendConfigManageCMD(uint8_t accd, uint8_t recordType, uint32_t timestamp, uint8_t cnfg, void *spec, uint16_t specLen, uint32_t timeout) {
	
	uint8_t 	frameData[MAX_PKT_LEN];
	uint8_t 	frameLen 		= 0; 
	uint8_t 	frameID			= 0;  
	uint8_t 	index 			= 0;
	uint8_t		i;
	PTC_RES		ptc_res;
	
	// Packet size   ***include timestamp in accd:update
	if(accd == CONF_ACCD_UPDATE) {
		// 				FID TYP    TGID   ACCD TIMESTAMP CNFG SPEC_LEN
		frameLen = 1  +1  +ADDR_LEN	 +1  		+4  		+1  +specLen; 
	}else {
		// 				FID TYP    TGID   ACCD CNFG SPEC_LEN
		frameLen = 1  +1  +ADDR_LEN	 +1   +1  +specLen; 
	}

	frameID = ucPKTQUEUE_GenerateID(packet_Queue);
	printDebug_Semphr(INFO, "<<<-- CONFIGURATION_MANAGEMENT CMD : FID[%04X]\r\n", frameID);
	
	/* Add config_log wait frame_id */
	if(recordType == RECORD_LOG) {
		_ConfigLog_WaitID = frameID;
	}
												
	frameData[index++] = frameID;                                           // Frame ID
	frameData[index++] = CONFMANC;                                         	// Frame Type                             
	for(i = 0; i < ADDR_LEN; i++) {                                         /* Source ID */
		frameData[index++]  = struct_info.serialNumber[i];
	}
	frameData[index++] = accd;                                         			// Frame Type  
	if(accd == CONF_ACCD_UPDATE) {																					// Timestamp (Only ACCD:UPDATE)
		memcpy(&frameData[index], &timestamp, sizeof(timestamp));           
		index += sizeof(timestamp);
	}
	frameData[index++] = cnfg;                                         			// Frame Type  
	if(specLen > 0) {
		memcpy(&frameData[index], spec, specLen);                  						// Specific Structure
		index += specLen;  
	}
	
// 	ptc_res = xPROCOMM_SendPacketToGSM(struct_info.destSerial, frameData, frameLen, timeout);
// 	if(ptc_res != PTC_OK) {               
// 		return PTC_SEND_FAIL;
// 	}
	
	return PTC_OK;
}
/*==========================================================================================*/
/**
  * @brief  Send Log Manipulattion Ack
  * @param  
  * @retval Return protocol function code
  */
PTC_RES xPROCOMM_SendLogManipulateACK(uint16_t frameID, uint8_t accd, uint8_t stat, uint8_t dest) {
	
	uint8_t 	frameData[4];
	uint8_t 	frameLen 		= 0;   
	uint8_t 	index 			= 0;
	PTC_RES		ptc_res;
	
	printDebug_Semphr(INFO, "<<<-- LOG_MANIPULATION ACK [%s] : FID[%04X]\r\n", (dest==GSM_PORT)?"GSM":"DEBUG", frameID);

	// 				FID TYP ACCD STAT 
	frameLen = 1  +1  +1   +1;
												
	frameData[index++] = frameID;                                           // Frame ID
	frameData[index++] = LOGMANIA;                                         	// Frame Type   
	frameData[index++] = accd;                                              // ACCD
	frameData[index++] = stat;                                              // STAT
	
