nexts-corp/int-sma/PWA_SL/Project/FreeRTOS/SmartLogger_Mini_SMA/INTELENICS_Library/src/INT_STM32F4_ProtocolComm.c
// 	if(dest == GSM_PORT) {
// 		ptc_res = xPROCOMM_SendPacketToGSM(struct_info.destSerial, frameData, frameLen, 0);
// 		if(ptc_res != PTC_OK) {               
// 			return PTC_SEND_FAIL;
// 		}
// 	}else if(dest == DEBUG_PORT) {
// 		ptc_res = xPROCOMM_SendPacketToDebug(struct_info.destSerial, frameData, frameLen, 0);
// 		if(ptc_res != PTC_OK) {               
// 			return PTC_SEND_FAIL;
// 		}
// 	}
	
	return PTC_OK;
}
/*==========================================================================================*/
/**
  * @brief  Send NetworkMaintenance Ack
  * @param  
  * @retval Return protocol function code
  */
PTC_RES xPROCOMM_SendNetworkMaintACK(uint16_t frameID, uint8_t cmd, uint8_t stat, uint8_t *spec, uint8_t specLen) {
	
	uint8_t 	frameData[MAX_PKT_LEN];
	uint8_t 	frameLen 		= 0;   
	uint8_t 	index 			= 0;
	PTC_RES		ptc_res;
	
	printDebug_Semphr(INFO, "<<<-- NETWORK_MAINTENANCE ACK : CMD[%04X]\r\n", cmd);

	// 				FID TYP CMD STAT SPEC_LEN
	frameLen = 1  +1  +1   +1  +specLen;
												
	frameData[index++] = frameID;                                           // Frame ID (Fixed 0xFF)
	frameData[index++] = NETMAINA;                                         	// Frame Type   
	frameData[index++] = cmd;                                              	// CMD
	frameData[index++] = stat;                                              // STAT
	if(specLen > 0) {
		memcpy(&frameData[index], spec, specLen);                  						// Specific Structure
		index += specLen;  
	}
	
// 	ptc_res = xPROCOMM_SendPacketToGSM(struct_info.destSerial, frameData, frameLen, 0);
// 	if(ptc_res != PTC_OK) {              
// 		return PTC_SEND_FAIL;
// 	}
	
	return PTC_OK;
}
/*==========================================================================================*/
/**
  * @brief  Send RemoteDeviecControl Ack
  * @param  
  * @retval Return protocol function code
  */
PTC_RES xPROCOMM_SendRemoteCtrlACK(uint16_t frameID, uint8_t cid, uint8_t stat, uint8_t dest) {
	
	uint8_t 	frameData[4];
	uint8_t 	frameLen 		= 0;   
	uint8_t 	index 			= 0;
	PTC_RES		ptc_res;
	
	printDebug_Semphr(INFO, "<<<-- REMOTE_DEVICE_CONTROL ACK [%s] : FID[%04X]\r\n", (dest==GSM_PORT)?"GSM":"DEBUG", frameID);

	// 				FID TYP CID STAT 
	frameLen = 1  +1  +1   +1;
												
	frameData[index++] = frameID;                                           // Frame ID (Fixed 0xFF)
	frameData[index++] = RMDCTRLA;                                         	// Frame Type   
	frameData[index++] = cid;                                              	// CMD
	frameData[index++] = stat;                                              // STAT
	
// 	if(dest == GSM_PORT) {
// 		ptc_res = xPROCOMM_SendPacketToGSM(struct_info.destSerial, frameData, frameLen, 0);
// 		if(ptc_res != PTC_OK) {               
// 			return PTC_SEND_FAIL;
// 		}
// 	}else if(dest == DEBUG_PORT) {
// 		
// 	}
	
	return PTC_OK;
}
/*==========================================================================================*/
/**
  * @brief  Send ConfigurationManagement Ack
  * @param  
  * @retval Return protocol function code
  */
PTC_RES xPROCOMM_SendConfigManageACK(uint16_t frameID, uint8_t accd, uint8_t cnfg, uint8_t stat, uint8_t *spec, uint16_t specLen, uint8_t dest) {
	
	uint16_t	MTI					= 0;
	uint8_t 	frameData[MAX_PKT_LEN];
	uint8_t 	frameLen 		= 0;   
	uint8_t 	index 			= 0;
	PTC_RES		ptc_res;
	RTC_DateTypeDef 	RTC_DateStruct;
	RTC_TimeTypeDef 	RTC_TimeStruct;
	
	uint32_t		timestamp 				= 0;
	
	vRTC_GetDateTime(&RTC_DateStruct, &RTC_TimeStruct, 0);
	timestamp = uiRTC_DateTimeToEpoch(RTC_DateStruct, RTC_TimeStruct);
	
	printDebug_Semphr(INFO, "<<<-- CONFIGURATION_MANAGEMENT ACK : FID[%04X] (%s)\r\n", frameID, (dest==GSM_PORT)?"GSM":"DEBUG");
	
	MTI = HOREMESC<<8 ;																											// Host Request Message
	
	if(accd == CONF_ACCD_WRITE) {
		// 				 TYP  LEN CNFG STAT
		frameLen = +1   +1   +1   +1;
		
		frameData[index++] = 0x4B;                                              // Frame Type
		frameData[index++] = 0x02;																							// Lenght of value
		frameData[index++] = cnfg;                                              // CNFG
		frameData[index++] = stat;                                              // STAT
		
	}else if(accd == CONF_ACCD_READ) {
		// 				 TYP LEN CNFG  SPEC_LEN
		frameLen = +1   +1   +1  +specLen;
		
		frameData[index++] = CONFMANC;                                         	// Frame Type
		frameData[index++] = specLen;																						// Lenght of value
		frameData[index++] = cnfg;                                              // CNFG
		if(specLen > 0) {
			memcpy(&frameData[index], spec, specLen);                  						// Specific Structure
			index += specLen;  
		}
	}
	
	if(dest == GSM_PORT) {
		ptc_res = xPROCOMM_SendPacketToGSM(timestamp, frameID, MTI, frameData, frameLen, 0);
		if(ptc_res != PTC_OK) {               
			return PTC_SEND_FAIL;
		}
	}else if(dest == DEBUG_PORT) {
		ptc_res = xPROCOMM_SendPacketToDebug(struct_info.destSerial, frameData, frameLen, 0);
		if(ptc_res != PTC_OK) {               
			return PTC_SEND_FAIL;
		}
	}
	
	return PTC_OK;
}
/*==========================================================================================*/
/**
  * @brief  Send ConfigurationManagement Request
  * @param  
  * @retval Return protocol function code
  */
PTC_RES xPROCOMM_SendConfigManageREQ(uint8_t dest) {

	uint16_t	MTI					= 0;
	uint8_t 	frameData[MAX_PKT_LEN];
	uint16_t	frameID 		= 0;
	uint8_t 	frameLen 		= 0;   
	uint8_t 	index 			= 0;
	PTC_RES		ptc_res;
	RTC_DateTypeDef 	RTC_DateStruct;
	RTC_TimeTypeDef 	RTC_TimeStruct;
	
	uint32_t		timestamp 				= 0;
	
	vRTC_GetDateTime(&RTC_DateStruct, &RTC_TimeStruct, 0);
	timestamp = uiRTC_DateTimeToEpoch(RTC_DateStruct, RTC_TimeStruct);
	
	printDebug_Semphr(INFO, "<<<-- CONFIGURATION_MANAGEMENT REQ : FID[%04X] (%s)\r\n", frameID, (dest==GSM_PORT)?"GSM":"DEBUG");
	
	//				No data
	frameLen = 0;
	
	MTI = HOREMESC<<8 ;																											// Host Request Message
	
// 	frameData[index++] = frameID;                                           // Frame ID (Fixed 0xFF)
// 	frameData[index++] = CONFMANC;                                         	// Frame Type   
	
	if(dest == GSM_PORT) {
		ptc_res = xPROCOMM_SendPacketToGSM(timestamp, frameID, MTI, frameData, frameLen, 0);
		if(ptc_res != PTC_OK) {               
			return PTC_SEND_FAIL;
		}
	}else if(dest == DEBUG_PORT) {
		ptc_res = xPROCOMM_SendPacketToDebug(struct_info.destSerial, frameData, frameLen, 0);
		if(ptc_res != PTC_OK) {               
			return PTC_SEND_FAIL;
		}
	}
	
	return PTC_OK;
}
/*==========================================================================================*/
/**
  * @brief  Send Data&Status Report Cmd
  * @param  
  * @retval Return protocol function code
  */
PTC_RES xPROCOMM_SendDataNStatusReportCMD(uint32_t timestamp, uint8_t recordType, uint8_t numStatSet, STATUS_SET *status, uint8_t numDatSet, DATA_SET *data, uint32_t timeout, uint8_t dest) {

