nexts-corp/int-sma/PWA_SL/Project/FreeRTOS/SmartLogger_Mini_SMA/INTELENICS_Library/src/INT_STM32F4_ProtocolComm.c
	uint8_t 	frameData[MAX_PKT_LEN];
	uint16_t	frameID			=	0;
	uint32_t 	frameLen 		= 0;
	uint16_t	MTI					=	0;
	uint32_t 	index 			= 0;	
	uint32_t 	i;
	PTC_RES		ptc_res;
	
	frameID = ucPKTQUEUE_GenerateID(packet_Queue);
	printDebug_Semphr(INFO, "<<<-- DATA&STATUS_REPORT CMD [%s] : FID[%04X]\r\n", (dest==GSM_PORT)?"GSM":"DEBUG", frameID);

	/*  					TYP_S						LEN_S							STAT_SIZE											TYP_D					LEN_D						DAT_SIZE										*/
	frameLen =	+numStatSet		+numStatSet		+(numStatSet*sizeof(STATUS_SET))	+numDatSet		+numDatSet		+(numDatSet*sizeof(DATA_SET));
	
	if((recordType != RECORD_RLT) && (recordType != RECORD_LOG)) {         
		/* Invalid Record Type */
		return PTC_FIELD_INVALID;
	}
	
	/* Set Message type indicator */
	if(recordType == RECORD_RLT) {
		MTI = (TRANMESC<<8) + (REQUMESF<<4) ;
	}else {	/* Add data_log wait frame_id */
		MTI = (BATUMESC<<8) + (REQUMESF<<4) ;
		_DataLog_WaitID = frameID;
	}
																																			 
	for(i = 0; i < numStatSet; i++) {                                      								/* Status Set */	
		frameData[index++] = STATREPC;                                       								/* Status Report COMMAND */
		frameData[index++] = (sizeof(STATUS_SET));																					/* Length of status set */
		memcpy(&frameData[index], &status[i], sizeof(STATUS_SET));
		index += sizeof(STATUS_SET);
	}
	
	for(i = 0; i < numDatSet; i++) {                                       								/* Data Set */
		frameData[index++] = DATAREPC;                                        							/* Data Report COMMAND */
		frameData[index++] = (sizeof(DATA_SET));																						/* Length of data set */
		memcpy(&frameData[index], &data[i], sizeof(DATA_SET));
		index += sizeof(DATA_SET);
	}
	
	if(dest == GSM_PORT) {
		ptc_res = xPROCOMM_SendPacketToGSM(timestamp, frameID, MTI, frameData, frameLen, timeout);
		if(ptc_res != PTC_OK) {               
			return PTC_SEND_FAIL;
		}
	}else if(dest == DEBUG_PORT) {
		ptc_res = xPROCOMM_SendPacketToDebug(struct_info.destSerial, frameData, frameLen, 0);
		if(ptc_res != PTC_OK) {               
			return PTC_SEND_FAIL;
		}
	}
	
	return PTC_OK;
}
/*==========================================================================================*/
/**
  * @brief  Send Data&Status Report Cmd
  * @param  
  * @retval Return protocol function code
  */
PTC_RES xPROCOMM_SendDataNStatusLog(uint32_t timestamp, uint16_t fTotal, uint16_t fNo, uint8_t numStatSet, STATUS_SET *status, uint8_t numDatSet, DATA_SET *data, uint32_t timeout) {

	uint8_t 	frameData[MAX_PKT_LEN];
	uint32_t 	frameLen 		= 0;
	uint32_t 	index 			= 0;	
	uint32_t 	i;
	PTC_RES		ptc_res;
	
	printDebug_Semphr(INFO, "<<<-- DATA&STATUS_LOG \r\n");
	
	/* 	      FID TYP TIM FTOTAL FNO NUM_S             STAT_SIZE            NUM_D            DAT_SIZE           */
	frameLen = 1  +1  +4   +2    +2   +1    +(numStatSet*sizeof(STATUS_SET))  +1   +(numDatSet*sizeof(DATA_SET));
	 
	frameData[index++] = 0xFF;												                                 									/* Frame ID */
	frameData[index++] = DNSTALOG;                                         															/* Frame Type */
	memcpy(&frameData[index], &timestamp, sizeof(timestamp));              															/* Timestamp */
	index += sizeof(timestamp);
																									
	frameData[index++] = (fTotal >> 8) & 0xFF;                                      										/* Frame Total 	- MSB */
  frameData[index++] = fTotal & 0xFF;                                                									/*             	- LSB */
	frameData[index++] = (fNo >> 8) & 0xFF;                                      												/* Frame Number - MSB */
  frameData[index++] = fNo & 0xFF;                                                										/*             	- LSB */
	frameData[index++] = numStatSet;                                       															/* Number of status set */
	
	for(i = 0; i < numStatSet; i++) {                                      															/* Status Set */	
		memcpy(&frameData[index], &status[i], sizeof(STATUS_SET));
		index += sizeof(STATUS_SET);
	}
	
	frameData[index++] = numDatSet;                                        															/* Number of data set */
	
	for(i = 0; i < numDatSet; i++) {                                       															/* Data Set */
		memcpy(&frameData[index], &data[i], sizeof(DATA_SET));
		index += sizeof(DATA_SET);
	}
	
	ptc_res = xPROCOMM_SendPacketToDebug(struct_info.destSerial, frameData, frameLen, 0);
	if(ptc_res != PTC_OK) {               
		return PTC_SEND_FAIL;
	}
	
	return PTC_OK;
}
/*==========================================================================================*/
/**
  * @brief  Send Event Report Cmd
  * @param  
  * @retval Return protocol function code
  */
PTC_RES xPROCOMM_SendEventReportCMD(uint32_t timestamp, uint8_t recordType, uint8_t eid, uint32_t edat, uint32_t timeout) {

	uint8_t 	i;
	uint8_t 	frameData[EV_FRAME_SIZE];
	uint8_t 	frameID			= 0;
	uint8_t 	index 			= 0;	 
	PTC_RES		ptc_res;
	
	frameID = ucPKTQUEUE_GenerateID(packet_Queue);
	printDebug_Semphr(INFO, "<<<-- EVENT_REPORT CMD : FID[%04X]\r\n", frameID);

	if((recordType != RECORD_RLT) && (recordType != RECORD_LOG)) {         
		/* Invalid Record Type */
		return PTC_FIELD_INVALID;
	}
	
	/* Add event_log wait frame_id */
	if(recordType == RECORD_LOG) {
		_EventLog_WaitID = frameID;
	}
	 
	frameData[index++] = frameID;                                																				/* Frame ID */
	frameData[index++] = EVENREPC;                                         															/* Frame Type */
	memcpy(&frameData[index], &timestamp, sizeof(timestamp));              															/* Timestamp */
	index += sizeof(timestamp);
	for(i = 0; i < ADDR_LEN; i++) {                                                											/* Source ID */
		frameData[index++]  = struct_info.serialNumber[i];
	}																																		 
	frameData[index++] = recordType;                                       															/* Record Type */
	frameData[index++] = eid;                                       																		/* Event ID */
	memcpy(&frameData[index], &edat, sizeof(edat));              																				/* Event Data */
	index += sizeof(edat);
	
