nexts-corp/int-sma/PWA_SL/Project/FreeRTOS/SmartLogger_Mini_SMA/INTELENICS_Library/src/INT_STM32F4_ProtocolComm.c
//	if(xSemaphoreTake(xSemaphore, SEMPHR_WAIT)) {
//		printDebug(INFO, "Event Data(%d):\r\n", index);
//		for(i = 0; i < EV_FRAME_SIZE; i++) {
//			printDebug(INFO, "%02X ", frameData[i]);
//		}
//		printDebug(INFO, "\r\n");
//		xSemaphoreGive(xSemaphore);
//	}
	
// 	ptc_res = xPROCOMM_SendPacketToGSM(struct_info.destSerial, frameData, EV_FRAME_SIZE, timeout);
// 	if(ptc_res != PTC_OK) {               
// 		return PTC_SEND_FAIL;
// 	}
	
	return PTC_OK;
}
/*==========================================================================================*/
/**
  * @brief  Send Data&Status Report Cmd
  * @param  
  * @retval Return protocol function code
  */
PTC_RES xPROCOMM_SendNetworkMaintCMD(uint8_t cmd, uint8_t *specData, uint8_t specDataLen, uint32_t timeout) {
	
	uint8_t 	frameData[MAX_PKT_LEN];
	uint8_t 	frameLen = 0;   
	uint8_t 	index = 0;
	PTC_RES		ptc_res;
	
	printDebug_Semphr(INFO, "<<<-- NETWORK_MAINTENANCE CMD : CMD[%02X] \r\n", cmd);

	// 				FID TYP CMD   SPEC_DATA
	frameLen = 1  +1  +1  +specDataLen;    
												
	frameData[index++] = 0xFF;                                             	// Frame ID (Fixed 0xFF)
	frameData[index++] = NETMAINC;                                         	// Frame Type                             
	frameData[index++] = cmd;                                              	// CMD
	if(specDataLen > 0) {
		memcpy(&frameData[index], specData, specDataLen);                  		// Specific Structure
		index += specDataLen;  
	}
	
// 	ptc_res = xPROCOMM_SendPacketToGSM(struct_info.destSerial, frameData, frameLen, timeout);
// 	if(ptc_res != PTC_OK) {               
// 		return PTC_SEND_FAIL;
// 	}
	
	return PTC_OK;
}
/*==========================================================================================*/
/**
  * @brief  Initial timer
  * @param  
  * @retval None
  */
PTC_RES xPROCOMM_SendPacketToDebug(uint8_t *recvAddr, uint8_t *data, uint32_t dataLen, uint32_t timeout) {
	
	uint8_t 	sendPacket[MAX_PKT_LEN];
	uint32_t 	packetLen 	= 0;
	uint8_t 	frameID			= 0;
	uint32_t 	frameLen 		= 0;
	uint32_t 	index 			= 0;
//	uint8_t 	res;
	
	/* 				Start Len ProtoVer  SendAddr  RecvAddr  Payload CheckSum   */
	packetLen = 1		+2     +1    +ADDR_LEN +ADDR_LEN +dataLen   +1;
	
	frameLen 	= packetLen - 4;
	frameID 	= data[0];
	
	sendPacket[index++] = 0x7E;                                                           /* Start Delimeter */
	sendPacket[index++] = (frameLen >> 8) & 0xFF;                                      		/* Packet Length - MSB */
  sendPacket[index++] = frameLen & 0xFF;                                                /*               - LSB */
	sendPacket[index++] = PTC_VERSION;                                                   	/* Protocal Version */
	memcpy(&sendPacket[index], &struct_info.serialNumber[0], ADDR_LEN);                   /* Sender Address */
	index += ADDR_LEN;
	memcpy(&sendPacket[index], &recvAddr[0], ADDR_LEN);                                   /* Receiver Address */
	index += ADDR_LEN;
	memcpy(&sendPacket[index], data, dataLen);                                            /* Payload */
	index += dataLen;
	sendPacket[index] = ucPROCOMM_Checksum(&sendPacket[3], frameLen);                			/* Checksum */
	
	/* Send packet to debug port */
	vDEBUG_SendData(sendPacket, packetLen);
	
	return PTC_OK;
}
/*==========================================================================================*/
/**
  * @brief  Initial timer
  * @param  
  * @retval None
  */
PTC_RES xPROCOMM_SendPacketToGSM(uint32_t timestamp, uint16_t frameID, uint16_t MTI, uint8_t *data, uint32_t dataLen, uint32_t timeout) {
	
	uint8_t 	sendPacket[MAX_PKT_LEN];
	uint32_t 	packetLen 	= 0;
	uint32_t 	frameLen 		= 0;
	uint32_t 	index 			= 0;
	uint8_t 	res;
	PACKET_DATA 	packet_data;
	
	/* 				Start Len 	MTI  SendAddr	  TIM	 FID		Payload 	CheckSum   */
	packetLen = 1		+2     +2	 +ADDR_LEN   +4	 +2			+dataLen    +1;
	
	frameLen 	= packetLen - 4;
	
	sendPacket[index++] = 0x7E;                                                           /* Start Delimeter */
	sendPacket[index++] = (frameLen >> 8) & 0xFF;                                      		/* Packet Length - MSB */
  sendPacket[index++] = frameLen & 0xFF;                                                /*               - LSB */
	sendPacket[index++] = (MTI >> 8) & 0xFF;                                      				/* Message Type indicator - MSB */
  sendPacket[index++] = MTI & 0xFF;                                                			/*               					- LSB */
	memcpy(&sendPacket[index], &struct_info.serialNumber[0], ADDR_LEN);                 	/* Sender Address */
	index += ADDR_LEN;
// 	memcpy(&sendPacket[index], &struct_info.destSerial[0], ADDR_LEN);                     /* Receiver Address */
// 	index += ADDR_LEN;
	memcpy(&sendPacket[index], &timestamp, sizeof(timestamp));														/* Timestamp */
	index += sizeof(timestamp);
	sendPacket[index++] = (frameID >> 8) & 0xFF;                                      		/* Frame ID - MSB */
  sendPacket[index++] = frameID & 0xFF;                                                	/*          - LSB */
	
	memcpy(&sendPacket[index], data, dataLen);                                            /* Payload */
	index += dataLen;
	sendPacket[index] = ucPROCOMM_Checksum(&sendPacket[3], frameLen);                			/* Checksum */
	
	if((timeout > 0) && (frameID != 0xFFFF)) {
		res = ucPKTQUEUE_Add(packet_Queue, &_Queue_counter, frameID, &sendPacket[0], packetLen, timeout);    
		if(res) {               
			return PTC_QUEUE_ERR;
		}
	}
	
	memcpy(packet_data.packet, sendPacket, packetLen);
	packet_data.length = packetLen;
	
	res = xQueueSend(Queue_PacketHTTPToGSM, &packet_data, 0);
	if(res != pdTRUE) {
		printDebug_Semphr(MINOR_ERR, "<PROCOMM_SendPacketToGSM>: Send Queue_PacketToGSM failed. \r\n");
	}
	
	return PTC_OK;
}
/*==========================================================================================*/
/**
  * @brief  Send HTTP Packet
  * @param  
  * @retval Protocol return code
  */
PTC_RES xPROCOMM_SendHTTPPacket(uint32_t timestamp, uint8_t numStatSet, STATUS_SET *status, uint8_t numDatSet, DATA_SET *data) {
	
	RTC_DateTypeDef 	RTC_DateStruct;
	RTC_TimeTypeDef 	RTC_TimeStruct;
	
