nexts-corp/int-sma/PWA_SL/Project/FreeRTOS/SmartLogger_Mini_SMA/INTELENICS_Library/src/INT_STM32F4_ProtocolComm.c
	uint8_t 	sendPacket[MAX_PKT_LEN];
	uint8_t		i;
	uint32_t 	packetLen 	= 0;
	
	uint8_t headerHTTP[] = "http://164.115.22.29/SmartSend29.php?query=";
	uint8_t		datetime[14];
	uint8_t 	res;
	
	// Value
	float 		ai1 = 0.0, ai2 = 0.0, ai3 = 0.0, ai4 = 0.0;
	float 		io5_counter = 0.0, io5_acc = 0.0, io6_digital = 0.0, accf = 0.0, accr = 0.0;
	uint8_t		csq = 0;
	float			vbatt = 0.0;
	// Null
	uint8_t		ao1 = 0, ao2 = 0, level = 0;
	uint8_t		io1 = 0, io2 = 0, io3 = 0, io4 = 0;
	
	PACKET_DATA 	packet_data;
	
	timestamp += (60*60*7);    // GMT+7
	vRTC_EpochToDateTime(&RTC_DateStruct, &RTC_TimeStruct, timestamp);
	sprintf((char*)datetime, "%04d%02d%02d%02d%02d%02d", 2000+RTC_DateStruct.RTC_Year,
																							RTC_DateStruct.RTC_Month,
																							RTC_DateStruct.RTC_Date,
																							RTC_TimeStruct.RTC_Hours, 
																							RTC_TimeStruct.RTC_Minutes, 
																							RTC_TimeStruct.RTC_Seconds);
												
	for(i = 0; i < numDatSet; i++) {
		if(data[i].channel == IN420MA_CH1) {
			ai1 = data[i].value;
		}else if(data[i].channel == IN420MA_CH2) {
			ai2 = data[i].value;
		}else if(data[i].channel == IN420MA_CH3) {
			ai3 = data[i].value;
		}else if(data[i].channel == IN420MA_CH4) {
			ai4 = data[i].value;
		}else if(data[i].channel == MB_CH1_FLOWRATE) {
			io6_digital = data[i].value;
		}else if(data[i].channel == MB_CH1_POS) {
			accf = data[i].value;
		}else if(data[i].channel == MB_CH1_NEG) {
			accr = data[i].value;
		}else if(data[i].channel == PUL_CH1_FLOWRATE) {
			io5_counter = data[i].value;
		}else if(data[i].channel == PUL_CH1_NETFLOW) {
			io5_acc = data[i].value;
		}
	}
	
	for(i = 0; i < numStatSet; i++) {
		if(status[i].statusType == GSM) {
			csq = status[i].value_int;
		}else if(status[i].statusType == BAT) {
			vbatt = status[i].value_float;
		}
	}
	
	/* Id_name, Pressure, AI2, AI3, AI4, AO1, AO2, io1, io2, io3, io4, Flow(Pulse), Flow(485), CSQ, VBATT, Flow(total), ACCF, ACCR, Level, datetime */
	sprintf((char*)sendPacket	,"%s%s,%0.3f,%0.3f,%0.3f,%0.3f,%d,%d,%d,%d,%d,%d,%0.3f,%0.3f,%d,%0.3f,%0.3f,%0.3f,%0.3f,%d,%s,%d,%d"
														, headerHTTP, struct_ConfigProperties.deviceName, ai1, ai2, ai3, ai4, ao1, ao2, io1, io2, io3, io4
														, io5_counter, io6_digital, csq, vbatt, io5_acc, accf, accr, level, datetime, 0, 0);
					
	packet_data.length = strlen((char*)sendPacket);
	memcpy(packet_data.packet, sendPacket, packet_data.length);
	
// 	res = xQueueSend(Queue_PacketHTTPToGSM, &packet_data, 0);
// 	if(res != pdTRUE) {
// 		printDebug_Semphr(MINOR_ERR, "<PROCOMM_SendHTTPPacket>: Send Queue_PacketToGSM failed. \r\n");
// 	}
}
/*============================================================================================
Support Function
============================================================================================*/
/**
  * @brief  Data Checksum
  * @param  
  * @retval Checksum Value
  */
uint8_t ucPROCOMM_Checksum(uint8_t buf[], uint32_t len) {

    uint32_t 	i = 0;
    uint8_t 	sum = 0;      
	
    for (i = 0; i < len; i++) {
        sum += buf[i];
    }                 
    return (0xFF - (sum & 0xFF));
}
/*==========================================================================================*/




